note/2021/blog-header/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-03-14 Sun 20:33 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How Long Should a Paragraph Be on the Web?</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Yuan Fu" />
<link id="style" rel="stylesheet" type="text/css" href="../../style.css"/>
<link rel="icon" type="image/png" href="../../../favicon.png">
</head>
<body>
<div id="preamble" class="status">
<div id="org-page-header">
<div>
<a accesskey="h" href="../../index.html"> UP </a> |
<a accesskey="H" href="../../../index.html"> HOME </a>
</div>
<div>
<a href="../../rss.xml"> RSS </a> |
<a href="https://github.com/casouri/casouri.github.io"> Source </a> | 
<a href="https://creativecommons.org/licenses/by-sa/4.0/"> License </a>
</div>
</div>
</div>
<div id="content">
<h1 class="title">How Long Should a Paragraph Be on the Web?</h1>
<p>
I often find that a screen full of text on the web is much more confusing and tiring to read than a page full of text in a physical book, even though the latter usually contains much more text. My theory is that when reading a physical book, you have (or at least feel) more control of your location and surroundings: you are presented with two pages side-by-side and can easily flip to previous and next page.
</p>

<p>
On the other hand, when you read an article in a browser, you see the article only through this small window, that’s far less scope than a physical book. And if you think of the prose as a map, you are given a much smaller map and naturally feels less clear of your location and surroundings.
</p>

<p>
Worse, instead of flipping pages and seeing the pages with no lag, you have to scroll to see the other parts. Scrolling is less precise, slower and harder keep track of mentally: at least for me, it is not easy to keep track of how far did I scroll, what I scrolled over, etc.
</p>

<p>
In a word, comparing to reading on a physical book, you mental map of the prose is greatly obfuscated when you scroll over it in a browser.
</p>

<p>
To mitigate this, I try to place landmarks around the prose to help readers keep track of their position and surrounding, or at least give them the feeling of in control. I try to make sure at any given moment, the reader can see at least one headers, images, or anything other than a blob of text in the screen. That, in my experience, makes reading in a browser more comfortable.
</p>
</div>
<div id="postamble" class="status">
<div class="like-button">
<form action="/like" method="post">
<input type="text" name="path" hidden value="/note/2021/blog-header/index.html" />
<button class="like" type="submit">❤ Like</button>
</form>
</div><div>
<p class="author">Written by Yuan Fu</p>
<p class="first-publish">First Published in 2021-02-01 Mon 00:00</p>
<p class-"last-modified">Last modified in 2021-03-14 Sun 20:33</p>
<p>Send your comment to 
<a href="mailto:archive.casouri.cat@gmail.com">
archive.casouri.cat@gmail.com</a></p>
</div>
</div>
</body>
</html>
